-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Апр 01 2026 г., 19:46
-- Версия сервера: 5.7.34-37-log
-- Версия PHP: 7.4.3-4ubuntu2.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `default-db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `announcement_reads`
--

CREATE TABLE `announcement_reads` (
  `user_id` int(11) NOT NULL,
  `announcement_id` int(11) NOT NULL,
  `read_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `app_announcements`
--

CREATE TABLE `app_announcements` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `body` text NOT NULL,
  `type` enum('update','info','warning') DEFAULT 'info',
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `birthdays`
--

CREATE TABLE `birthdays` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `type` varchar(30) DEFAULT 'birthday',
  `day` int(11) NOT NULL,
  `month` int(11) NOT NULL,
  `year` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `notify_before` int(11) DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `birthdays`
--

INSERT INTO `birthdays` (`id`, `user_id`, `name`, `type`, `day`, `month`, `year`, `created_at`, `notify_before`) VALUES
(2, 4, 'Артем ', 'birthday', 21, 2, 2026, '2026-02-19 11:38:18', 1),
(3, 4, 'Я', 'birthday', 22, 2, 2026, '2026-02-19 11:38:29', 1),
(4, 4, 'Мама ', 'birthday', 14, 8, 2026, '2026-02-19 11:38:56', 1),
(5, 4, 'Леля', 'birthday', 30, 11, 2026, '2026-02-19 11:39:09', 1),
(7, 4, 'Тетя нина', 'birthday', 20, 2, 2026, '2026-02-20 12:51:50', 1),
(8, 4, 'Просто так', 'birthday', 21, 4, 2026, '2026-03-17 16:44:30', 1),
(9, 4, 'Моё сокровище', 'birthday', 5, 3, 2026, '2026-03-17 16:45:46', 1),
(10, 1004, 'День рождения мамы', 'birthday', 15, 4, 1975, '2026-03-21 10:09:10', 3),
(11, 1004, 'День рождения друга', 'birthday', 22, 5, 1990, '2026-03-21 10:09:10', 2),
(12, 1004, 'Встреча по личному проекту', 'event', 12, 9, NULL, '2026-03-21 10:09:10', 1),
(13, 1004, 'Годовщина работы', 'important', 1, 3, 2020, '2026-03-21 10:09:10', 7),
(14, 1004, 'Отпуск', 'event', 10, 7, 2026, '2026-03-21 10:09:10', 14),
(15, 1005, 'День рождения мамы', 'birthday', 15, 4, 1975, '2026-03-21 10:34:17', 3),
(16, 1005, 'День рождения друга', 'birthday', 22, 5, 1990, '2026-03-21 10:34:17', 2),
(17, 1005, 'Встреча по личному проекту', 'event', 12, 9, NULL, '2026-03-21 10:34:17', 1),
(18, 1005, 'Годовщина работы', 'important', 1, 3, 2020, '2026-03-21 10:34:17', 7),
(19, 1005, 'Отпуск', 'event', 10, 7, 2026, '2026-03-21 10:34:17', 14),
(21, 1006, 'День рождения друга', 'birthday', 22, 5, 1990, '2026-03-21 10:37:34', 2),
(22, 1006, 'Встреча по личному проекту', 'event', 12, 9, NULL, '2026-03-21 10:37:34', 1),
(23, 1006, 'Годовщина работы', 'important', 1, 3, 2020, '2026-03-21 10:37:34', 7),
(24, 1006, 'Отпуск', 'event', 10, 7, 2026, '2026-03-21 10:37:34', 14),
(32, 4, 'Мама', 'birthday', 14, 8, 1969, '2026-03-24 14:41:27', 1),
(33, 4, 'Жена', 'birthday', 19, 6, 1998, '2026-03-24 14:41:55', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `chat_settings`
--

CREATE TABLE `chat_settings` (
  `setting_key` varchar(50) NOT NULL,
  `setting_value` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `chat_settings`
--

INSERT INTO `chat_settings` (`setting_key`, `setting_value`) VALUES
('gmo_mode', 'off'),
('login_title', 'Раз, два ...'),
('sacred_text', 'И так это первая сходка, какой план?');

-- --------------------------------------------------------

--
-- Структура таблицы `email_logs`
--

CREATE TABLE `email_logs` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `email` varchar(255) NOT NULL,
  `subject` varchar(255) NOT NULL,
  `message_id` varchar(255) DEFAULT NULL,
  `status` enum('sent','failed','bounced') DEFAULT 'sent',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Структура таблицы `email_verifications`
--

CREATE TABLE `email_verifications` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `code` varchar(6) NOT NULL,
  `expires_at` datetime NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `email_verifications`
--

INSERT INTO `email_verifications` (`id`, `email`, `code`, `expires_at`, `created_at`) VALUES
(3, 'brain-gena@mail.ru', '134640', '2026-01-27 06:27:51', '2026-01-27 06:12:51'),
(25, '123@mail.ru', '314020', '2026-01-28 12:06:29', '2026-01-28 11:51:29'),
(26, 'mister.gasan2011@yandex.ru', '417990', '2026-01-30 06:10:54', '2026-01-30 05:55:53'),
(28, 'igoshev88@inbox.ru', '653303', '2026-01-30 06:18:56', '2026-01-30 06:03:55'),
(35, 'braginga@uwca.ru', '579858', '2026-02-15 16:42:04', '2026-02-15 16:27:03');

-- --------------------------------------------------------

--
-- Структура таблицы `folders`
--

CREATE TABLE `folders` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `icon` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `emoji` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `order_index` int(11) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `folders`
--

INSERT INTO `folders` (`id`, `user_id`, `name`, `icon`, `emoji`, `created_at`, `order_index`) VALUES
(1, 4, 'Работа', '💼', NULL, '2026-03-15 13:34:51', 3),
(2, 4, 'Дом', '🏠', NULL, '2026-03-15 13:37:58', 0),
(3, 4, 'Проект', '💰', NULL, '2026-03-15 13:38:13', 2),
(6, 1004, 'Работа', '💼', NULL, '2026-03-21 10:25:34', 1),
(7, 4, 'Семья', '❤️', NULL, '2026-03-24 04:51:37', 1),
(8, 1002, 'КОНТЕНТ', '🚀', NULL, '2026-03-26 18:47:00', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `habits`
--

CREATE TABLE `habits` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `unit` varchar(50) DEFAULT 'раз',
  `plan` int(11) DEFAULT '0',
  `target_type` enum('daily','monthly') NOT NULL DEFAULT 'monthly',
  `start_date` date DEFAULT NULL,
  `end_date` date DEFAULT NULL,
  `days_of_week` json DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `order_index` int(11) DEFAULT '0',
  `start_year` int(11) DEFAULT NULL,
  `start_month` int(11) DEFAULT NULL,
  `year` int(11) DEFAULT NULL,
  `month` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `habits`
--

INSERT INTO `habits` (`id`, `user_id`, `name`, `unit`, `plan`, `target_type`, `start_date`, `end_date`, `days_of_week`, `created_at`, `order_index`, `start_year`, `start_month`, `year`, `month`) VALUES
(42, 4, 'ТЕСТ ПЕРЕНОС 1', 'Дни', 10, 'monthly', NULL, NULL, NULL, '2026-02-12 04:48:25', 4, NULL, NULL, NULL, NULL),
(43, 4, 'ТЕСТ ПЕРЕНОС 2', 'Часы', 12, 'monthly', NULL, NULL, NULL, '2026-02-12 04:48:32', 5, NULL, NULL, NULL, NULL),
(48, 4, 'Пп', 'Часы', 5, 'monthly', NULL, NULL, NULL, '2026-02-12 14:59:44', 3, 2026, 2, NULL, NULL),
(50, 1000, 'Спать больше 6 часов', 'Дни', 30, 'monthly', NULL, NULL, NULL, '2026-02-16 04:59:59', 0, 2026, 2, NULL, NULL),
(51, 1000, 'Мяу', 'Часы', 11, 'monthly', NULL, NULL, NULL, '2026-02-16 05:08:41', 0, 2026, 2, NULL, NULL),
(52, 6, 'Заняться монтажом', 'Часы', 20, 'monthly', NULL, NULL, NULL, '2026-02-16 05:09:53', 0, 2026, 2, NULL, NULL),
(59, 4, 'Подтягивания ', 'Кол-во', 50, 'daily', '2026-02-19', '2026-02-28', '[1, 3, 5]', '2026-02-19 04:33:11', 7, 2026, 2, NULL, NULL),
(61, 4, 'Пресс', 'Кол-во', 20, 'monthly', NULL, NULL, NULL, '2026-02-19 08:09:12', 4, 2026, 2, NULL, NULL),
(62, 4, 'Пресс качат', 'Кол-во', 20, 'daily', '2026-02-19', '2026-02-28', '[1, 2, 3, 4, 5]', '2026-02-19 08:24:19', 3, 2026, 2, NULL, NULL),
(65, 4, 'Чтение ', 'Часы', 10, 'daily', '2026-02-19', '2026-02-26', '[1, 2, 3, 4, 5]', '2026-02-19 09:42:57', 5, NULL, NULL, 2026, 2),
(66, 4, 'Чтение 2', 'Часы', 100, 'monthly', NULL, NULL, '[]', '2026-02-19 09:44:40', 2, NULL, NULL, 2026, 2),
(67, 4, 'Помнить', 'Дни', 28, 'monthly', NULL, NULL, '[]', '2026-02-19 09:51:38', 5, NULL, NULL, 2026, 2),
(68, 4, 'Работа над проектом ', 'Часы', 70, 'monthly', NULL, NULL, '[]', '2026-02-22 18:59:53', 3, NULL, NULL, 2026, 2),
(69, 1001, 'Учеба', 'Часы', 3, 'monthly', NULL, NULL, '[]', '2026-03-13 14:14:13', 0, NULL, NULL, 2026, 3),
(70, 1001, 'Работа ', 'Часы', 8, 'monthly', NULL, NULL, '[]', '2026-03-13 14:14:40', 0, NULL, NULL, 2026, 3),
(71, 1001, 'Учеба ', 'Часы', 3, 'daily', '2026-03-13', '2026-05-11', '[]', '2026-03-13 15:07:02', 0, NULL, NULL, 2026, 3),
(98, 8, 'Чтение ', 'Кол-во', 5, 'daily', NULL, NULL, '[]', '2026-03-23 10:35:41', 0, 2026, 3, NULL, NULL),
(99, 8, 'Слушать музыку ', 'Часы', 1, 'daily', NULL, NULL, '[]', '2026-03-23 10:36:06', 0, 2026, 3, NULL, NULL),
(100, 8, 'Тест', 'Дни', 1, 'daily', NULL, NULL, '[]', '2026-03-23 10:55:12', 0, 2026, 3, NULL, NULL),
(101, 8, 'Тест', 'Кол-во', 1, 'daily', NULL, NULL, '[]', '2026-03-23 10:55:24', 0, 2026, 3, NULL, NULL),
(104, 1002, 'МОНТАЖ ', 'Дни', 2, 'daily', NULL, NULL, '[1, 2, 3, 4, 5, 6, 0]', '2026-03-26 19:07:43', 0, 2026, 3, NULL, NULL),
(105, 4, 'Дайджест семья', 'Дни', 1, 'daily', '2026-03-25', NULL, '[]', '2026-03-27 02:36:00', 0, 2026, 3, NULL, NULL),
(106, 4, 'Дайджест инвест', 'Дни', 1, 'daily', '2026-03-27', NULL, '[]', '2026-03-27 02:36:30', 0, 2026, 3, NULL, NULL),
(107, 4, 'Упражнения для шеи', 'Дни', 1, 'daily', '2026-03-27', NULL, '[]', '2026-03-27 02:37:24', 0, 2026, 3, NULL, NULL),
(108, 4, 'Приседания (min)', 'Кол-во', 50, 'daily', '2026-03-27', NULL, '[]', '2026-03-27 02:38:37', 0, 2026, 3, NULL, NULL),
(109, 4, 'Отжимания (min)', 'Кол-во', 70, 'daily', '2026-03-27', NULL, '[]', '2026-03-27 02:39:12', 0, 2026, 3, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `habit_monthly_configs`
--

CREATE TABLE `habit_monthly_configs` (
  `id` int(11) NOT NULL,
  `habit_id` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `month` int(11) NOT NULL,
  `plan` int(11) DEFAULT '0',
  `unit` varchar(50) DEFAULT NULL,
  `is_archived` tinyint(1) DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `habit_monthly_configs`
--

INSERT INTO `habit_monthly_configs` (`id`, `habit_id`, `year`, `month`, `plan`, `unit`, `is_archived`, `created_at`) VALUES
(4, 43, 2026, 2, 0, NULL, 1, '2026-02-12 05:49:34'),
(5, 50, 2026, 2, 0, NULL, 1, '2026-02-16 05:01:19'),
(12, 48, 2026, 2, 0, NULL, 1, '2026-02-16 15:44:52'),
(13, 42, 2026, 2, 0, NULL, 1, '2026-02-16 15:44:58'),
(57, 59, 2026, 2, 50, 'Кол-во', 1, '2026-02-19 06:23:43'),
(60, 61, 2026, 2, 20, 'Кол-во', 1, '2026-02-19 08:09:35'),
(61, 62, 2026, 2, 20, 'Кол-во', 1, '2026-02-19 08:24:42'),
(71, 65, 2026, 2, 0, NULL, 1, '2026-02-22 18:57:52'),
(72, 66, 2026, 2, 0, NULL, 1, '2026-02-22 18:57:55'),
(74, 67, 2026, 2, 0, NULL, 1, '2026-02-22 18:59:01'),
(88, 59, 2026, 3, 0, NULL, 1, '2026-03-03 17:34:35'),
(90, 67, 2026, 3, 0, NULL, 1, '2026-03-03 17:34:46'),
(91, 43, 2026, 3, 0, NULL, 1, '2026-03-03 17:34:52'),
(92, 61, 2026, 3, 0, NULL, 1, '2026-03-03 17:34:56'),
(93, 42, 2026, 3, 0, NULL, 1, '2026-03-03 17:35:03'),
(94, 62, 2026, 3, 0, NULL, 1, '2026-03-03 17:35:33'),
(101, 66, 2026, 3, 0, NULL, 1, '2026-03-03 17:36:19'),
(102, 48, 2026, 3, 0, NULL, 1, '2026-03-03 17:36:25'),
(105, 65, 2026, 3, 0, NULL, 1, '2026-03-17 17:55:15');

-- --------------------------------------------------------

--
-- Структура таблицы `habit_records`
--

CREATE TABLE `habit_records` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `habit_id` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `month` int(11) NOT NULL,
  `day` int(11) NOT NULL,
  `value` varchar(255) DEFAULT '0',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `habit_records`
--

INSERT INTO `habit_records` (`id`, `user_id`, `habit_id`, `year`, `month`, `day`, `value`, `updated_at`) VALUES
(635, 4, 43, 2026, 1, 1, '1', '2026-02-12 05:28:11'),
(636, 4, 43, 2026, 1, 2, '1', '2026-02-12 05:28:11'),
(639, 4, 42, 2026, 1, 1, '1', '2026-02-12 05:28:13'),
(640, 4, 42, 2026, 1, 2, '1', '2026-02-12 05:28:13'),
(641, 4, 42, 2026, 1, 3, '1', '2026-02-12 05:28:17'),
(643, 4, 43, 2026, 1, 3, '1', '2026-02-12 05:28:18'),
(644, 4, 43, 2026, 1, 4, '1', '2026-02-12 05:28:20'),
(646, 4, 42, 2026, 1, 4, '1', '2026-02-12 05:28:21'),
(647, 4, 42, 2026, 1, 6, '1', '2026-02-12 05:28:21'),
(649, 4, 42, 2026, 1, 5, '1', '2026-02-12 05:28:22'),
(650, 4, 43, 2026, 1, 5, '1', '2026-02-12 05:28:22'),
(651, 4, 43, 2026, 1, 6, '1', '2026-02-12 05:28:23'),
(653, 4, 42, 2026, 1, 7, '1', '2026-02-12 05:28:24'),
(655, 4, 43, 2026, 1, 7, '1', '2026-02-12 05:28:25'),
(769, 4, 59, 2026, 2, 22, '50', '2026-02-19 06:09:44'),
(797, 4, 59, 2026, 2, 17, '9', '2026-02-19 08:08:24'),
(818, 4, 59, 2026, 2, 21, '50', '2026-02-19 08:43:11'),
(821, 4, 59, 2026, 2, 20, '50', '2026-02-19 08:44:02'),
(822, 4, 59, 2026, 2, 23, '50', '2026-02-19 08:44:05'),
(823, 4, 59, 2026, 2, 25, '50', '2026-02-19 08:44:06'),
(825, 4, 61, 2026, 2, 24, '20', '2026-02-19 08:44:10'),
(831, 4, 62, 2026, 2, 23, '20', '2026-02-19 09:28:38'),
(832, 4, 62, 2026, 2, 26, '20', '2026-02-19 09:28:40'),
(833, 4, 62, 2026, 2, 27, '20', '2026-02-19 09:28:41'),
(834, 4, 62, 2026, 2, 25, '20', '2026-02-19 09:28:42'),
(842, 4, 65, 2026, 2, 19, '12', '2026-02-19 09:51:04'),
(847, 4, 66, 2026, 2, 19, '3', '2026-02-19 09:51:15'),
(850, 4, 67, 2026, 2, 19, '1', '2026-02-19 09:51:44'),
(852, 4, 66, 2026, 2, 2, '2', '2026-02-19 09:54:34'),
(856, 4, 61, 2026, 2, 19, '5', '2026-02-19 09:58:12'),
(857, 4, 62, 2026, 2, 19, '20', '2026-02-19 09:58:13'),
(871, 4, 61, 2026, 2, 20, '4', '2026-02-19 14:00:22'),
(875, 4, 65, 2026, 2, 20, '2', '2026-02-19 14:00:31'),
(878, 4, 62, 2026, 2, 20, '20', '2026-02-19 14:00:46'),
(879, 4, 68, 2026, 2, 23, '2', '2026-02-23 11:47:33'),
(881, 4, 66, 2026, 2, 25, '1', '2026-02-23 11:52:20'),
(894, 4, 68, 2026, 3, 14, '2', '2026-03-14 18:58:09'),
(897, 4, 68, 2026, 3, 17, '2', '2026-03-17 17:39:04'),
(907, 4, 68, 2026, 3, 18, '1', '2026-03-17 17:39:33'),
(1266, 4, 68, 2026, 3, 22, '1', '2026-03-22 05:11:54'),
(1332, 4, 68, 2026, 3, 23, '3', '2026-03-23 10:51:32'),
(1356, 8, 100, 2026, 3, 25, '1', '2026-03-23 10:58:39'),
(1373, 8, 98, 2026, 3, 23, '5', '2026-03-23 11:00:24'),
(1380, 8, 99, 2026, 3, 23, '2', '2026-03-23 11:00:51'),
(1383, 4, 68, 2026, 3, 1, '2', '2026-03-25 17:22:43'),
(1402, 1002, 104, 2026, 4, 1, '1', '2026-03-26 19:11:47'),
(1420, 4, 68, 2026, 3, 25, '1', '2026-03-27 02:36:04'),
(1421, 4, 68, 2026, 3, 26, '1', '2026-03-27 02:36:05'),
(1422, 4, 105, 2026, 3, 25, '1', '2026-03-27 02:36:08'),
(1423, 4, 105, 2026, 3, 26, '1', '2026-03-27 02:36:09'),
(1428, 4, 105, 2026, 3, 27, '1', '2026-03-28 06:52:41'),
(1429, 4, 68, 2026, 3, 27, '2', '2026-03-28 06:52:47'),
(1436, 1002, 104, 2026, 3, 28, '1', '2026-03-28 19:36:09'),
(1437, 1002, 104, 2026, 3, 27, '1', '2026-03-28 19:36:20'),
(1440, 4, 68, 2026, 3, 29, '8.3', '2026-03-29 15:07:58'),
(1468, 4, 105, 2026, 3, 29, '1', '2026-03-29 14:24:34'),
(1474, 4, 109, 2026, 3, 29, '70', '2026-03-29 16:27:33'),
(1476, 4, 108, 2026, 3, 28, '50', '2026-03-29 16:31:42'),
(1478, 1002, 104, 2026, 3, 30, '1', '2026-03-30 06:14:29'),
(1479, 1002, 104, 2026, 3, 29, '2', '2026-03-30 06:14:41'),
(1481, 4, 68, 2026, 3, 30, '11.3', '2026-03-30 06:49:15'),
(1482, 4, 43, 2026, 3, 30, '1', '2026-03-30 07:06:03'),
(1483, 4, 61, 2026, 3, 30, '1', '2026-03-30 07:06:14'),
(1484, 4, 105, 2026, 3, 30, '1', '2026-03-30 10:46:00'),
(1485, 4, 106, 2026, 3, 30, '1', '2026-03-30 10:46:28'),
(1486, 4, 107, 2026, 3, 30, '1', '2026-03-30 16:13:51'),
(1487, 4, 108, 2026, 3, 30, '50', '2026-03-30 16:17:51'),
(1488, 4, 109, 2026, 3, 30, '70', '2026-03-30 17:08:32'),
(1490, 4, 109, 2026, 3, 28, '70', '2026-03-30 17:09:25'),
(1491, 4, 42, 2026, 2, 27, '1', '2026-03-30 17:11:38'),
(1493, 4, 105, 2026, 4, 1, '1', '2026-04-01 16:37:30'),
(1494, 4, 106, 2026, 4, 1, '1', '2026-04-01 16:37:31'),
(1495, 4, 107, 2026, 4, 1, '1', '2026-04-01 16:40:27');

-- --------------------------------------------------------

--
-- Структура таблицы `message_reactions`
--

CREATE TABLE `message_reactions` (
  `id` int(11) NOT NULL,
  `message_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `type` varchar(20) DEFAULT 'tomato'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `message_reactions`
--

INSERT INTO `message_reactions` (`id`, `message_id`, `user_id`, `type`) VALUES
(1, 9, 8, 'tomato'),
(3, 20, 6, 'tomato'),
(4, 20, 8, 'tomato'),
(8, 20, 4, 'tomato'),
(46, 16, 1001, 'tomato'),
(50, 14, 1001, 'tomato'),
(53, 20, 1001, 'tomato'),
(55, 20, 1000, 'tomato'),
(57, 31, 1001, 'tomato');

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE `password_resets` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `code` varchar(10) NOT NULL,
  `expires_at` datetime NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `secret_chat`
--

CREATE TABLE `secret_chat` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `user_name` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `secret_chat`
--

INSERT INTO `secret_chat` (`id`, `user_id`, `user_name`, `content`, `created_at`) VALUES
(2, 6, 'Даниил', 'Хуй знает ', '2026-02-16 09:39:13'),
(4, 8, 'Андрей', 'мммм... м-м-м... (звуки из подвала)', '2026-02-16 09:40:10'),
(5, 8, 'Андрей', '*пытается что-то сказать, но рот заклеен ботвой*', '2026-02-16 09:40:24'),
(6, 8, 'Андрей', 'мммм... м-м-м... (звуки из подвала)', '2026-02-16 09:40:34'),
(7, 8, 'Андрей', '*пытается что-то сказать, но рот заклеен ботвой*', '2026-02-16 09:40:37'),
(8, 8, 'Андрей', 'мммм... м-м-м... (звуки из подвала)', '2026-02-16 09:40:40'),
(9, 6, 'Даниил', 'Андрей лох', '2026-02-16 09:40:42'),
(12, 6, 'Даниил', 'Mys', '2026-02-16 09:49:05'),
(14, 6, 'Даниил', '*невнятно мычит через кабачок*', '2026-02-16 09:49:30'),
(16, 6, 'Даниил', 'Миау', '2026-02-16 09:49:44'),
(20, 1001, 'Александр ', '(:-)', '2026-02-16 11:32:04'),
(31, 1001, 'Александр ', 'Ку', '2026-02-16 11:36:06'),
(33, 1001, 'Александр ', '*пытается что-то сказать, но рот заклеен ботвой*', '2026-02-16 11:36:32'),
(41, 8, 'Андрей', 'Мау', '2026-02-19 05:49:50'),
(42, 8, 'Андрей', 'И', '2026-02-19 09:40:39'),
(44, 4, 'Геннадий ', 'Ссылочка на обнову', '2026-02-19 11:25:02'),
(45, 4, 'Геннадий ', 'https://expo.dev/artifacts/eas/iAs5DGveN3LMGDqVspMmYB.apk', '2026-02-19 11:25:05'),
(46, 8, 'Андрей', 'Работает ', '2026-02-19 15:32:49'),
(48, 8, 'Андрей', 'Да бля', '2026-02-19 15:33:11');

-- --------------------------------------------------------

--
-- Структура таблицы `secret_chat_messages`
--

CREATE TABLE `secret_chat_messages` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `text` text NOT NULL,
  `is_author` tinyint(1) DEFAULT '0',
  `tomato_count` int(11) DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `secret_chat_messages`
--

INSERT INTO `secret_chat_messages` (`id`, `user_id`, `text`, `is_author`, `tomato_count`, `created_at`) VALUES
(1, 4, 'Так проверка после обновы бд', 0, 0, '2026-03-25 10:18:47'),
(2, 4, 'Проверка связи', 1, 0, '2026-03-25 10:18:58');

-- --------------------------------------------------------

--
-- Структура таблицы `secret_chat_settings`
--

CREATE TABLE `secret_chat_settings` (
  `key` varchar(64) NOT NULL,
  `value` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `secret_chat_settings`
--

INSERT INTO `secret_chat_settings` (`key`, `value`) VALUES
('chat_password', 'Даниил'),
('login_title', 'Как зовут Даню'),
('sacred_text', '');

-- --------------------------------------------------------

--
-- Структура таблицы `secret_chat_user_meta`
--

CREATE TABLE `secret_chat_user_meta` (
  `user_id` int(11) NOT NULL,
  `rank_name` varchar(500) DEFAULT 'Семечка Сомнения',
  `gmo_infected` tinyint(1) DEFAULT '0',
  `mute_until` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `subtasks`
--

CREATE TABLE `subtasks` (
  `id` bigint(20) NOT NULL,
  `task_id` bigint(20) NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `completed` tinyint(1) DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `subtasks`
--

INSERT INTO `subtasks` (`id`, `task_id`, `title`, `completed`, `created_at`) VALUES
(10, 1769773613856, 'Манка твердых сортов ', 1, '2026-02-17 07:38:15'),
(11, 1769773613856, 'Курица', 1, '2026-02-17 07:38:25'),
(13, 1769773613854, '123', 0, '2026-02-18 12:20:19'),
(17, 1769773613887, 'Математика ', 0, '2026-03-13 15:05:38'),
(18, 1769773613887, 'Информатика', 0, '2026-03-13 15:05:47'),
(19, 1769773613887, 'Материаловедение ', 0, '2026-03-13 15:05:55'),
(20, 1769773613887, 'Английский язык ', 0, '2026-03-13 15:06:03'),
(21, 1769773613888, 'Хлеб', 0, '2026-03-14 17:40:24'),
(22, 1769773613888, 'Тест', 0, '2026-03-14 17:40:28'),
(23, 1769773613955, 'Пыль', 1, '2026-03-24 04:59:25'),
(24, 1769773613955, 'Сушилка 2', 1, '2026-03-24 04:59:33'),
(25, 1769773613955, 'Одежда ', 1, '2026-03-24 04:59:39'),
(26, 1769773613955, 'Пылесос', 0, '2026-03-24 04:59:46'),
(27, 1769773613955, 'Ванна + туалет', 1, '2026-03-24 04:59:55'),
(31, 1769773613964, 'Колбаса магнит ', 1, '2026-03-24 06:36:22'),
(33, 1769773613964, 'Сок апельсиновый ', 0, '2026-03-24 06:36:47'),
(34, 1769773613964, 'Перец черный ', 1, '2026-03-24 06:37:33'),
(35, 1769773613964, 'Чудо', 1, '2026-03-24 06:37:39'),
(48, 1769773613979, 'Заказать ', 1, '2026-03-27 05:42:48'),
(50, 1769773614004, 'Найти рецепт ', 0, '2026-03-28 06:54:43');

-- --------------------------------------------------------

--
-- Структура таблицы `tasks`
--

CREATE TABLE `tasks` (
  `id` bigint(20) NOT NULL,
  `user_id` int(11) NOT NULL DEFAULT '1',
  `date` date DEFAULT NULL,
  `deadline` date DEFAULT NULL,
  `title` varchar(500) DEFAULT NULL,
  `priority` int(11) DEFAULT '2',
  `comment` text,
  `done` tinyint(1) DEFAULT '0',
  `done_date` date DEFAULT NULL,
  `focus_sessions` int(11) DEFAULT '0',
  `is_recurring` tinyint(1) DEFAULT '0',
  `recurrence_type` varchar(50) DEFAULT NULL,
  `recurrence_value` varchar(50) DEFAULT NULL,
  `is_generated` tinyint(1) DEFAULT '0',
  `template_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `time` varchar(5) DEFAULT NULL,
  `folder_id` int(11) DEFAULT NULL,
  `subtasks_count` int(11) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `tasks`
--

INSERT INTO `tasks` (`id`, `user_id`, `date`, `deadline`, `title`, `priority`, `comment`, `done`, `done_date`, `focus_sessions`, `is_recurring`, `recurrence_type`, `recurrence_value`, `is_generated`, `template_id`, `created_at`, `updated_at`, `time`, `folder_id`, `subtasks_count`) VALUES
(1769773613798, 8, '2026-02-04', NULL, 'ремонт', 2, '', 1, '2026-02-16', NULL, 0, NULL, NULL, 0, NULL, '2026-02-04 08:43:14', '2026-02-16 08:04:06', NULL, NULL, 0),
(1769773613804, 9, '2026-02-05', '2026-02-05', 'Приготовить кушать', 2, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-02-05 09:10:50', '2026-02-05 09:11:24', NULL, NULL, 0),
(1769773613823, 11, '2026-02-13', '2026-02-13', 'ТЕСТ', 2, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-02-13 19:31:07', '2026-02-13 19:31:07', NULL, NULL, 0),
(1769773613835, 6, '2026-02-16', '2026-02-16', 'Поиграть в Баттерфилд ', 3, '', 1, '2026-02-18', NULL, 0, NULL, NULL, 0, NULL, '2026-02-16 05:01:25', '2026-02-18 10:20:52', NULL, NULL, 0),
(1769773613837, 6, '2026-02-16', '2026-02-16', 'Сходить на тренировку ', 2, '', 1, '2026-02-18', NULL, 0, NULL, NULL, 0, NULL, '2026-02-16 05:08:19', '2026-02-18 10:20:50', NULL, NULL, 0),
(1769773613840, 6, '2026-02-16', '2026-02-16', 'Позвонить отделение 5', 2, '', 1, '2026-02-16', NULL, 0, NULL, NULL, 0, NULL, '2026-02-16 05:09:08', '2026-02-16 10:45:02', NULL, NULL, 0),
(1769773613845, 6, '2026-02-27', '2026-02-27', 'Заплатить за бахчибомжи', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-02-16 05:35:33', '2026-02-16 05:35:33', NULL, NULL, 0),
(1769773613848, 4, '2026-02-16', '2026-02-16', 'Купить булочки ', 2, '', 1, '2026-02-19', NULL, 0, NULL, NULL, 0, NULL, '2026-02-16 07:44:13', '2026-02-19 17:08:16', NULL, NULL, 0),
(1769773613849, 8, '2026-02-16', '2026-02-16', 'Kupit', 2, '', 1, '2026-02-19', NULL, 0, NULL, NULL, 0, NULL, '2026-02-16 08:13:14', '2026-02-19 15:33:49', NULL, NULL, 0),
(1769773613850, 6, '2026-03-02', '2026-03-02', 'Отказаться от подписки яндекс', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-02-16 08:55:04', '2026-02-16 08:55:04', NULL, NULL, 0),
(1769773613853, 4, '2026-02-28', '2026-02-28', 'Оплата кладовки ', 2, '', 1, '2026-02-19', NULL, 0, NULL, NULL, 0, NULL, '2026-02-17 02:04:33', '2026-02-19 13:55:52', NULL, NULL, 0),
(1769773613854, 4, '2026-02-22', '2026-02-22', 'Др. Мама. 18:00', 2, '', 1, '2026-02-19', NULL, 0, NULL, NULL, 0, NULL, '2026-02-17 02:05:32', '2026-02-19 05:42:00', NULL, NULL, 0),
(1769773613855, 4, '2026-02-22', '2026-02-22', 'Ирина мама приезжает', 2, '', 1, '2026-02-19', NULL, 0, NULL, NULL, 0, NULL, '2026-02-17 02:05:59', '2026-02-19 13:56:05', NULL, NULL, 0),
(1769773613856, 4, '2026-02-17', '2026-02-17', 'Зайти в монетку', 2, '', 1, '2026-02-19', NULL, 0, NULL, NULL, 0, NULL, '2026-02-17 07:38:03', '2026-02-19 04:20:29', NULL, NULL, 0),
(1769773613860, 4, '2026-02-19', '2026-02-19', 'Запустить приложение 2.0', 2, '', 1, '2026-02-19', NULL, 0, NULL, NULL, 0, NULL, '2026-02-19 11:41:12', '2026-02-19 11:58:22', NULL, NULL, 0),
(1769773613861, 8, '2026-04-01', '2026-04-01', 'Купит', 2, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-02-19 15:34:05', '2026-02-19 15:34:05', NULL, NULL, 0),
(1769773613862, 4, '2026-02-20', '2026-02-20', 'Мише подарок выбрать ', 2, '', 1, '2026-02-20', NULL, 0, NULL, NULL, 0, NULL, '2026-02-19 17:08:54', '2026-02-20 17:00:57', NULL, NULL, 0),
(1769773613863, 4, '2026-02-20', '2026-02-20', 'Подарок Марату ', 2, '', 1, '2026-02-21', NULL, 0, NULL, NULL, 0, NULL, '2026-02-19 17:09:08', '2026-02-21 12:08:47', NULL, NULL, 0),
(1769773613864, 4, '2026-02-21', '2026-02-21', '21 числа почта России ', 2, '', 1, '2026-02-21', NULL, 0, NULL, NULL, 0, NULL, '2026-02-19 17:09:22', '2026-02-21 12:08:50', NULL, NULL, 0),
(1769773613865, 4, '2026-02-22', '2026-02-22', 'Приезд Ириной мамы 16:00', 2, '', 1, '2026-02-22', NULL, 0, NULL, NULL, 0, NULL, '2026-02-19 17:09:41', '2026-02-22 18:55:00', NULL, NULL, 0),
(1769773613866, 4, '2026-02-20', '2026-02-20', 'Ктг Ирина 13:10', 2, '', 1, '2026-02-20', NULL, 0, NULL, NULL, 0, NULL, '2026-02-19 17:10:46', '2026-02-20 17:00:59', NULL, NULL, 0),
(1769773613868, 4, '2026-02-21', '2026-02-21', 'Забрать шасси коляски', 2, '', 1, '2026-02-21', NULL, 0, NULL, NULL, 0, NULL, '2026-02-20 02:27:49', '2026-02-21 12:08:51', NULL, NULL, 0),
(1769773613869, 4, '2026-02-20', '2026-02-20', 'Предзаказ мама ', 2, '', 1, '2026-02-20', NULL, 0, NULL, NULL, 0, NULL, '2026-02-20 17:00:54', '2026-02-20 17:26:03', NULL, NULL, 0),
(1769773613870, 4, '2026-02-21', '2026-02-21', 'Парикмахерская 20:30', 2, '', 1, '2026-02-21', NULL, 0, NULL, NULL, 0, NULL, '2026-02-20 17:26:20', '2026-02-21 16:38:46', NULL, NULL, 0),
(1769773613871, 4, '2026-02-21', '2026-02-21', 'Отвести вещи в мегк', 2, '', 1, '2026-02-21', NULL, 0, NULL, NULL, 0, NULL, '2026-02-20 17:26:32', '2026-02-21 12:08:54', NULL, NULL, 0),
(1769773613872, 4, '2026-02-21', '2026-02-21', 'Помыть машину', 2, '', 1, '2026-02-22', NULL, 0, NULL, NULL, 0, NULL, '2026-02-20 17:27:15', '2026-02-22 18:54:54', NULL, NULL, 0),
(1769773613873, 4, '2026-02-21', '2026-02-23', 'Разработать логотип ', 3, '', 1, '2026-02-24', 0, 0, NULL, NULL, 0, NULL, '2026-02-20 19:21:58', '2026-02-24 08:24:53', NULL, NULL, 0),
(1769773613874, 1002, '2026-03-09', '2026-04-09', 'Курс Грачева по соц.сетям', 2, '', 1, '2026-03-27', 0, 0, NULL, NULL, 0, NULL, '2026-02-21 18:48:30', '2026-03-27 05:29:12', NULL, NULL, 0),
(1769773613875, 1002, '2026-02-22', '2026-02-22', 'Не проспать на работу ', 1, '', 1, '2026-02-22', NULL, 0, NULL, NULL, 0, NULL, '2026-02-21 18:49:29', '2026-02-22 11:09:02', NULL, NULL, 0),
(1769773613876, 4, '2026-02-23', '2026-02-23', 'Промокод папе', 2, '', 1, '2026-02-23', NULL, 0, NULL, NULL, 0, NULL, '2026-02-22 18:55:16', '2026-02-23 11:45:26', NULL, NULL, 0),
(1769773613877, 4, '2026-02-23', '2026-02-23', 'Подарок Мише ', 2, '', 1, '2026-02-23', NULL, 0, NULL, NULL, 0, NULL, '2026-02-22 18:55:28', '2026-02-23 11:45:27', NULL, NULL, 0),
(1769773613878, 4, '2026-02-23', '2026-02-23', 'Написать теме по пирогам', 2, '', 1, '2026-02-23', NULL, 0, NULL, NULL, 0, NULL, '2026-02-22 18:55:49', '2026-02-23 11:45:29', NULL, NULL, 0),
(1769773613880, 4, '2026-02-23', '2026-02-23', 'Отвести Мише подарок ', 2, '', 1, '2026-02-23', NULL, 0, NULL, NULL, 0, NULL, '2026-02-22 18:56:38', '2026-02-23 11:45:32', NULL, NULL, 0),
(1769773613886, 6, '2026-02-27', '2026-03-27', 'Начать заниматься монтажом', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-02-27 06:16:26', '2026-02-27 06:16:26', NULL, NULL, 0),
(1769773613887, 1001, '2026-03-13', '2026-05-11', 'Учеба ', 1, '', 1, '2026-03-23', 0, 0, NULL, NULL, 0, NULL, '2026-03-13 15:05:23', '2026-03-23 11:03:42', NULL, NULL, 0),
(1769773613888, 4, '2026-03-14', '2026-03-14', 'Купить тест', 2, '', 1, '2026-03-14', 0, 0, NULL, NULL, 0, NULL, '2026-03-14 17:39:59', '2026-03-14 18:00:24', NULL, NULL, 0),
(1769773613905, 4, '2026-03-21', NULL, 'Печать о гражданстве ', 1, '', 1, '2026-03-30', 0, 0, NULL, NULL, 0, NULL, '2026-03-17 14:12:27', '2026-03-30 16:59:34', NULL, 2, 0),
(1769773613910, 1004, '2026-03-21', '2026-03-21', 'Пить воду в течение дня', 2, 'Цель: 8 стаканов за день', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:09:10', '2026-03-21 10:09:10', '09:00', NULL, 0),
(1769773613911, 1004, '2026-03-21', NULL, '20 минут чтения книги', 2, 'Подойдет любая книга из списка', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:09:10', '2026-03-21 10:25:43', '21:00', 6, 0),
(1769773613912, 1004, '2026-03-20', '2026-03-20', 'Тренировка: отжимания', 1, '3 подхода по 10 повторений', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:09:10', '2026-03-21 10:09:10', '19:00', NULL, 0),
(1769773613913, 1004, '2026-03-22', '2026-03-24', 'Разобрать задачи по проекту', 1, 'Собрать приоритеты и сроки', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:09:10', '2026-03-21 10:09:10', '11:30', NULL, 0),
(1769773613914, 1004, '2026-03-21', NULL, 'Прогулка 3 км', 3, 'Спокойный темп, без спешки', 1, '2026-03-21', 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:09:10', '2026-03-21 10:09:10', '07:30', NULL, 0),
(1769773613915, 1004, '2026-03-22', NULL, 'Проверить почту и календарь', 3, 'План на день и новые события', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:09:10', '2026-03-21 10:09:10', '08:30', NULL, 0),
(1769773613916, 1005, '2026-03-21', '2026-03-21', 'Пить воду в течение дня', 2, 'Цель: 8 стаканов за день', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:34:17', '2026-03-21 10:34:17', '09:00', NULL, 0),
(1769773613917, 1005, '2026-03-21', NULL, '20 минут чтения книги', 2, 'Подойдет любая книга из списка', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:34:17', '2026-03-21 10:34:17', '21:00', NULL, 0),
(1769773613918, 1005, '2026-03-20', '2026-03-20', 'Тренировка: отжимания', 1, '3 подхода по 10 повторений', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:34:17', '2026-03-21 10:34:17', '19:00', NULL, 0),
(1769773613919, 1005, '2026-03-22', '2026-03-24', 'Разобрать задачи по проекту', 1, 'Собрать приоритеты и сроки', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:34:17', '2026-03-21 10:34:17', '11:30', NULL, 0),
(1769773613920, 1005, '2026-03-21', NULL, 'Прогулка 3 км', 3, 'Спокойный темп, без спешки', 1, '2026-03-21', 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:34:17', '2026-03-21 10:34:17', '07:30', NULL, 0),
(1769773613921, 1005, '2026-03-22', NULL, 'Проверить почту и календарь', 3, 'План на день и новые события', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:34:17', '2026-03-21 10:34:17', '08:30', NULL, 0),
(1769773613922, 1006, '2026-03-21', '2026-03-21', 'Пить воду в течение дня', 2, 'Цель: 8 стаканов за день', 1, '2026-03-21', 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:37:34', '2026-03-21 10:38:18', '09:00', NULL, 0),
(1769773613923, 1006, '2026-03-21', NULL, '20 минут чтения книги', 2, 'Подойдет любая книга из списка', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:37:34', '2026-03-21 10:37:34', '21:00', NULL, 0),
(1769773613925, 1006, '2026-03-22', '2026-03-24', 'Разобрать задачи по проекту', 1, 'Собрать приоритеты и сроки', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:37:34', '2026-03-21 10:37:34', '11:30', NULL, 0),
(1769773613926, 1006, '2026-03-21', NULL, 'Прогулка 3 км', 3, 'Спокойный темп, без спешки', 1, '2026-03-21', 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:37:34', '2026-03-21 10:37:34', '07:30', NULL, 0),
(1769773613927, 1006, '2026-03-22', NULL, 'Проверить почту и календарь', 3, 'План на день и новые события', 1, '2026-03-21', 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:37:34', '2026-03-21 10:38:28', '08:30', NULL, 0),
(1769773613928, 1006, '2026-03-21', NULL, 'Test', 2, '', 1, '2026-03-21', 0, 0, NULL, NULL, 0, NULL, '2026-03-21 10:38:06', '2026-03-21 10:38:23', NULL, NULL, 0),
(1769773613946, 4, '2026-03-24', NULL, 'Сделать копии документов по спику', 2, '', 1, '2026-03-24', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 04:47:17', '2026-03-24 06:31:11', '11:20', 2, 0),
(1769773613947, 4, '2026-03-31', NULL, 'Заплатить за кладовку ', 1, '', 1, '2026-04-01', 0, 1, 'monthly', NULL, 0, NULL, '2026-03-24 04:47:52', '2026-04-01 16:35:20', NULL, 2, 0),
(1769773613948, 4, '2026-04-06', NULL, 'Оплата кредита', 1, '', 0, NULL, 0, 1, 'monthly', NULL, 0, NULL, '2026-03-24 04:48:21', '2026-03-26 11:12:57', '12:00', 2, 0),
(1769773613949, 4, '2026-03-28', NULL, 'Оплата квартиры', 2, '', 1, '2026-03-29', 0, 1, 'monthly', NULL, 0, NULL, '2026-03-24 04:49:54', '2026-03-29 11:09:27', '14:00', 2, 0),
(1769773613950, 4, '2026-03-28', '2026-03-31', 'Отправить расписку в УЗГА за квартиру ', 2, '', 0, NULL, 0, 1, 'monthly', NULL, 0, NULL, '2026-03-24 04:50:57', '2026-03-24 04:50:57', '09:00', 1, 0),
(1769773613951, 4, '2026-03-24', '2026-03-25', 'Найти мелкие косяки в приложении ', 2, '', 1, '2026-03-24', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 04:54:28', '2026-03-24 08:36:54', NULL, 3, 0),
(1769773613952, 4, '2026-03-24', '2026-03-25', 'Исправить косяки, пересборка', 2, '', 1, '2026-03-24', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 04:54:55', '2026-03-24 17:30:37', NULL, 3, 0),
(1769773613953, 4, '2026-03-24', '2026-03-25', 'Подать заявление на регистрацию ', 1, '', 1, '2026-03-30', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 04:55:42', '2026-03-30 10:07:22', NULL, 7, 0),
(1769773613954, 4, '2026-03-24', '2026-03-27', 'Собрать информацию о подачи документов на субсидию на приобретение жилья ', 2, '', 1, '2026-03-24', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 04:56:31', '2026-03-24 12:35:57', NULL, 7, 0),
(1769773613955, 4, '2026-03-24', NULL, 'Уборка ', 3, '', 1, '2026-03-25', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 04:57:13', '2026-03-25 16:52:25', NULL, 2, 0),
(1769773613956, 4, '2026-03-24', '2026-03-29', 'Наточить ножи', 3, '', 1, '2026-03-24', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 04:57:31', '2026-03-24 14:55:44', NULL, 2, 0),
(1769773613957, 4, '2026-03-26', '2026-03-29', 'Найти как залететь на рустор', 2, '', 1, '2026-03-26', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 04:58:21', '2026-03-26 13:56:05', NULL, 3, 0),
(1769773613958, 4, '2026-03-24', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-03-24', 0, 1, 'daily', NULL, 0, NULL, '2026-03-24 04:58:51', '2026-03-24 08:36:13', '10:00', 7, 0),
(1769773613961, 4, '2026-03-24', '2026-03-27', 'Повешать ключницу', 2, '', 1, '2026-03-30', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 05:12:57', '2026-03-30 08:21:30', NULL, 2, 0),
(1769773613962, 4, '2026-04-02', NULL, 'Поликлиника п.шаманова 16', 2, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-24 06:31:50', '2026-03-24 06:31:50', '12:00', 7, 0),
(1769773613963, 4, '2026-04-09', NULL, 'Комиссия медицинская ', 2, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-24 06:32:21', '2026-03-24 06:32:21', '13:00', 7, 0),
(1769773613964, 4, '2026-03-24', NULL, 'Купить ', 2, '', 1, '2026-03-24', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 06:36:13', '2026-03-24 10:38:26', NULL, 2, 0),
(1769773613965, 4, '2026-03-25', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-03-25', 0, 1, 'daily', NULL, 0, NULL, '2026-03-24 08:36:13', '2026-03-25 11:40:44', '10:00', 7, 0),
(1769773613966, 4, '2026-03-27', NULL, 'Проверить запись на донорство ', 2, '', 1, '2026-03-27', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 09:45:46', '2026-03-27 02:45:05', NULL, NULL, 0),
(1769773613967, 4, '2026-04-01', NULL, 'Проверить запись на донорство ', 2, '', 1, '2026-04-01', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 09:46:00', '2026-04-01 16:35:25', NULL, NULL, 0),
(1769773613969, 4, '2026-03-25', NULL, 'Позвонить по молодой семье ', 2, '', 1, '2026-03-25', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 14:30:07', '2026-03-25 11:36:39', NULL, NULL, 0),
(1769773613970, 4, '2026-03-30', NULL, 'Получить ИНН МФЦ ', 2, '', 1, '2026-04-01', 0, 0, NULL, NULL, 0, NULL, '2026-03-24 14:30:50', '2026-04-01 16:35:16', '16:50', 7, 0),
(1769773613974, 4, '2026-03-30', NULL, 'Мфц по молодой семье ', 2, '', 1, '2026-04-01', 0, 0, NULL, NULL, 0, NULL, '2026-03-25 11:36:33', '2026-04-01 16:35:11', '16:20', 7, 0),
(1769773613975, 4, '2026-03-25', '2026-03-27', 'Подготовить документы которые возможно для МФЦ согласно перечню ', 2, '', 1, '2026-03-29', 0, 0, NULL, NULL, 0, NULL, '2026-03-25 11:37:11', '2026-03-29 15:12:39', NULL, 7, 0),
(1769773613976, 4, '2026-03-26', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-03-26', 0, 1, 'daily', NULL, 0, NULL, '2026-03-25 11:40:44', '2026-03-26 13:56:00', '10:00', 3, 0),
(1769773613977, 4, '2026-03-26', NULL, 'Заявление в ркн', 2, '', 1, '2026-03-27', 0, 0, NULL, NULL, 0, NULL, '2026-03-25 16:52:47', '2026-03-27 11:08:30', NULL, 3, 0),
(1769773613978, 4, '2026-03-25', '2026-04-24', 'Вывод проекта на рустор', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-25 17:21:32', '2026-03-30 16:17:35', NULL, 3, 0),
(1769773613979, 4, '2026-03-27', NULL, 'Картридж днс', 2, '', 1, '2026-03-28', 0, 0, NULL, NULL, 0, NULL, '2026-03-26 13:23:36', '2026-03-28 08:57:26', NULL, NULL, 0),
(1769773613981, 4, '2026-03-27', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-03-27', 0, 1, 'daily', NULL, 0, NULL, '2026-03-26 13:56:00', '2026-03-27 13:16:01', '10:00', 3, 0),
(1769773613982, 1002, '2026-04-05', NULL, 'СНЯТЬ ИСХОДИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 18:56:11', '2026-03-26 19:09:59', NULL, 8, 0),
(1769773613983, 1002, '2026-03-28', NULL, 'СНЯТЬ ИСХОДНИК ', 1, '', 1, '2026-03-28', 0, 0, NULL, NULL, 0, NULL, '2026-03-26 18:57:18', '2026-03-28 19:34:34', NULL, 8, 0),
(1769773613984, 1002, '2026-03-29', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 1, '2026-03-29', 0, 0, NULL, NULL, 0, NULL, '2026-03-26 18:57:31', '2026-03-29 16:40:13', NULL, 8, 0),
(1769773613985, 1002, '2026-03-30', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 18:57:43', '2026-03-26 18:57:43', NULL, 8, 0),
(1769773613986, 1002, '2026-03-31', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 18:57:55', '2026-03-26 18:57:55', NULL, 8, 0),
(1769773613988, 1002, '2026-04-01', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 18:59:19', '2026-03-26 18:59:19', NULL, 8, 0),
(1769773613989, 1002, '2026-04-02', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 18:59:44', '2026-03-26 18:59:44', NULL, 8, 0),
(1769773613990, 1002, '2026-04-03', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 18:59:58', '2026-03-26 18:59:58', NULL, 8, 0),
(1769773613991, 1002, '2026-04-04', NULL, 'СНЯТЬ ИСХОДНИК', 2, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 19:00:12', '2026-03-26 19:00:12', NULL, 8, 0),
(1769773613992, 1002, '2026-04-06', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 19:00:37', '2026-03-26 19:10:46', NULL, 8, 0),
(1769773613993, 1002, '2026-04-07', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-26 19:01:07', '2026-03-26 19:01:07', NULL, 8, 0),
(1769773613994, 4, '2026-03-27', NULL, 'Ежедневный дайджест по инвестициям ', 2, '', 1, '2026-03-29', 0, 0, NULL, NULL, 0, NULL, '2026-03-27 02:35:06', '2026-03-29 14:21:03', NULL, NULL, 0),
(1769773613995, 4, '2026-04-09', NULL, 'Донорство Пальмира 9:22', 2, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-27 02:45:32', '2026-03-27 02:45:50', NULL, 7, 0),
(1769773613996, 1002, '2026-04-10', NULL, 'Доп. исходник ', 2, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-27 06:07:50', '2026-03-27 06:07:50', NULL, NULL, 0),
(1769773613997, 1002, '2026-04-16', NULL, 'СНЯТЬ ИСХОДНИК', 1, '', 0, NULL, 0, 0, NULL, NULL, 0, NULL, '2026-03-27 06:12:36', '2026-03-27 06:12:36', NULL, NULL, 0),
(1769773613998, 1002, '2026-03-27', NULL, 'СНЯТЬ ИСХОДНИК ', 1, '', 1, '2026-03-27', 0, 0, NULL, NULL, 0, NULL, '2026-03-27 08:23:53', '2026-03-27 08:24:24', NULL, NULL, 0),
(1769773613999, 4, '2026-03-28', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-03-29', 0, 1, 'daily', NULL, 0, NULL, '2026-03-27 13:16:01', '2026-03-29 14:21:13', '10:00', 3, 0),
(1769773614000, 4, '2026-03-28', NULL, 'Пользовательское соглашение ', 2, '', 1, '2026-03-28', 0, 0, NULL, NULL, 0, NULL, '2026-03-28 06:51:01', '2026-03-28 08:57:38', NULL, 3, 0),
(1769773614001, 4, '2026-03-28', NULL, 'Согласие на обработку персональных данных ', 2, '', 1, '2026-03-28', 0, 0, NULL, NULL, 0, NULL, '2026-03-28 06:51:16', '2026-03-28 08:57:39', NULL, 3, 0),
(1769773614002, 4, '2026-03-28', NULL, 'Снять деньги ', 2, '', 1, '2026-03-28', 0, 0, NULL, NULL, 0, NULL, '2026-03-28 06:53:10', '2026-03-28 08:57:44', NULL, NULL, 0),
(1769773614003, 4, '2026-03-28', NULL, 'Помыть коврик', 2, '', 1, '2026-03-28', 0, 0, NULL, NULL, 0, NULL, '2026-03-28 06:54:08', '2026-03-28 06:54:16', NULL, 7, 0),
(1769773614004, 4, '2026-03-28', NULL, 'Запечь мясо ', 2, '', 1, '2026-03-29', 0, 0, NULL, NULL, 0, NULL, '2026-03-28 06:54:31', '2026-03-29 11:09:24', NULL, 2, 0),
(1769773614006, 4, '2026-03-28', NULL, 'Заказать шланг для душа ', 2, '', 1, '2026-03-29', 0, 0, NULL, NULL, 0, NULL, '2026-03-28 07:00:51', '2026-03-29 11:10:08', NULL, 2, 0),
(1769773614007, 4, '2026-04-28', NULL, 'Оплата квартиры', 2, '', 0, NULL, 0, 1, 'monthly', NULL, 1, 2147483647, '2026-03-29 11:09:27', '2026-03-29 11:09:27', '14:00', 2, 0),
(1769773614009, 4, '2026-03-29', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-03-29', 0, 1, 'daily', NULL, 0, NULL, '2026-03-29 14:21:13', '2026-03-29 14:21:38', '10:00', 3, 0),
(1769773614010, 4, '2026-03-30', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-03-30', 0, 1, 'daily', NULL, 0, NULL, '2026-03-29 14:21:38', '2026-03-30 16:17:17', '10:00', 3, 0),
(1769773614014, 4, '2026-03-31', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-04-01', 0, 1, 'daily', NULL, 0, NULL, '2026-03-30 16:17:17', '2026-04-01 16:35:07', '10:00', 3, 0),
(1769773614015, 4, '2026-02-02', NULL, 'Тест архив ', 2, '', 1, '2026-03-30', 0, 0, NULL, NULL, 0, NULL, '2026-03-30 17:02:11', '2026-03-30 17:02:28', NULL, NULL, 0),
(1769773614016, 4, '2026-04-01', NULL, 'Ежедневный дайджест ', 1, '', 1, '2026-04-01', 0, 1, 'daily', NULL, 0, NULL, '2026-04-01 16:35:07', '2026-04-01 16:35:23', '10:00', 3, 0),
(1769773614017, 4, '2026-05-01', NULL, 'Заплатить за кладовку ', 1, '', 0, NULL, 0, 1, 'monthly', NULL, 1, 2147483647, '2026-04-01 16:35:20', '2026-04-01 16:35:20', NULL, 2, 0),
(1769773614018, 4, '2026-04-02', NULL, 'Ежедневный дайджест ', 1, '', 0, NULL, 0, 1, 'daily', NULL, 1, 2147483647, '2026-04-01 16:35:23', '2026-04-01 16:35:23', '10:00', 3, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `tasks_backup`
--

CREATE TABLE `tasks_backup` (
  `id` bigint(20) NOT NULL DEFAULT '0',
  `user_id` int(11) NOT NULL DEFAULT '1',
  `date` date DEFAULT NULL,
  `deadline` date DEFAULT NULL,
  `title` varchar(500) DEFAULT NULL,
  `priority` int(11) DEFAULT '2',
  `comment` text,
  `done` tinyint(1) DEFAULT '0',
  `done_date` date DEFAULT NULL,
  `focus_sessions` int(11) DEFAULT '0',
  `is_recurring` tinyint(1) DEFAULT '0',
  `recurrence_type` varchar(50) DEFAULT NULL,
  `recurrence_value` varchar(50) DEFAULT NULL,
  `is_generated` tinyint(1) DEFAULT '0',
  `template_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `tasks_backup`
--

INSERT INTO `tasks_backup` (`id`, `user_id`, `date`, `deadline`, `title`, `priority`, `comment`, `done`, `done_date`, `focus_sessions`, `is_recurring`, `recurrence_type`, `recurrence_value`, `is_generated`, `template_id`, `created_at`, `updated_at`) VALUES
(2147483647, 1, '2026-01-29', NULL, 'тест', 2, '', 1, '2026-01-30', 0, 0, NULL, NULL, 0, NULL, '2026-01-29 10:22:20', '2026-01-30 04:10:29');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `birthdate` date DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `email_verified` tinyint(1) DEFAULT '0',
  `gender` enum('male','female') DEFAULT 'male',
  `rank` varchar(255) DEFAULT 'Семечка Сомнения',
  `muted_until` datetime DEFAULT NULL,
  `is_cult_member` tinyint(1) DEFAULT '0',
  `gmo_infected` tinyint(1) DEFAULT '0',
  `privacy_accepted` tinyint(1) DEFAULT '0',
  `terms_accepted` tinyint(1) DEFAULT '0',
  `email_marketing_accepted` tinyint(1) DEFAULT '0',
  `policies_accepted_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `email`, `password`, `name`, `birthdate`, `created_at`, `email_verified`, `gender`, `rank`, `muted_until`, `is_cult_member`, `gmo_infected`, `privacy_accepted`, `terms_accepted`, `email_marketing_accepted`, `policies_accepted_at`) VALUES
(4, 'bragin-gena@mail.ru', '$2a$10$GJmczWHbIPICz3uU7d3aFeo9pnov33Dbb4YjfCCcIDmWAFPhpfwmC', 'Геннадий ', '1998-02-22', '2026-01-27 09:23:59', 1, 'male', '4й градус свекольного созерцания', NULL, 1, 0, 1, 1, 1, '2026-03-29 14:08:38'),
(6, 'danil.permiakov2017@gmail.com', '$2a$10$AEXWXSekG6bMV5MEU3ipj.juKb/dmlZg4sUTnX11c0/oY72E0LVJa', 'Даниил', '2001-01-10', '2026-01-27 10:43:40', 1, 'male', '7й градус чесночного проникновения', NULL, 1, 0, 0, 0, 0, NULL),
(8, 'gav099@mail.ru', '$2a$10$Nm2Doz.cTHFXX8orHVZ5l.F58G7UTlyowqTUNYB4Qg2F.yjegYVy6', 'Андрей', '1998-06-01', '2026-02-03 11:48:00', 1, 'male', 'Семечка Сомнения', NULL, 1, 0, 0, 0, 0, NULL),
(9, 'larikeeeee@mail.ru', '$2a$10$EjTVm.7tctVgJJkB//ZXt.PpizE7G/2NerTmXgmgLZoxtF1CYIwiC', 'Лариса', '2000-11-30', '2026-02-05 09:06:38', 1, 'male', 'Семечка Сомнения', NULL, 0, 0, 0, 0, 0, NULL),
(10, 'braginanatusya@mail.ru', '$2a$10$TI9K69Ks1tp9Gp5P637CJ..u9lWOqMPL7FpXQWXRntkWBcBj.SldO', 'Наталья', '1969-08-14', '2026-02-05 10:39:04', 1, 'male', 'Семечка Сомнения', NULL, 0, 0, 0, 0, 0, NULL),
(11, 'bragin.gena1998@gmail.com', '$2a$10$c14.jhBDn92qIObSL5SIHuO5my1SvI/o3kJRUNoxh9Y/huhXZnJMC', 'Гена', '1998-02-22', '2026-02-13 08:12:28', 1, 'male', '3й градус огуречной расфокусировки', NULL, 1, 1, 0, 0, 0, NULL),
(1000, 'chernov_artem2022@mail.ru', '$2a$10$ReAW.Z2TF22kLggQZqRhmOOPioHIFk/EqfFg8KXzYFGMIuxDCfIVG', 'Артем', '2001-02-21', '2026-02-16 04:45:31', 1, 'male', '6й градус лукового забвения', NULL, 1, 0, 0, 0, 0, NULL),
(1001, '1111SancheZ1111@mail.ru', '$2a$10$BpHHBvNRV77vSQBPiSems.bPhS5kwIq/J3iQcgucH7NKrtmlQ.h2q', 'Александр ', '1992-07-31', '2026-02-16 06:22:16', 1, 'male', 'Семечка Сомнения', NULL, 1, 1, 0, 0, 0, NULL),
(1002, 'samvelt@vk.com', '$2a$10$MgwEl4FmLdhryAbM2b27reNSA.Sb7O6.VLAdrqWp0ofYWspbqzOgW', 'Савелий ', '2001-07-16', '2026-02-21 18:44:12', 1, 'male', 'Семечка Сомнения', NULL, 0, 0, 0, 0, 0, NULL),
(1003, 'irochka_irishka@list.ru', '$2a$10$/LJCpycHq6uElrCpZf6hj.iaXkQkTI/nr8XsP8J36ANlOIXD82s8G', 'Тест юзер', '2026-03-20', '2026-03-20 15:55:09', 1, 'male', 'Семечка Сомнения', NULL, 0, 0, 0, 0, 0, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `announcement_reads`
--
ALTER TABLE `announcement_reads`
  ADD PRIMARY KEY (`user_id`,`announcement_id`);

--
-- Индексы таблицы `app_announcements`
--
ALTER TABLE `app_announcements`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `birthdays`
--
ALTER TABLE `birthdays`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `chat_settings`
--
ALTER TABLE `chat_settings`
  ADD PRIMARY KEY (`setting_key`);

--
-- Индексы таблицы `email_logs`
--
ALTER TABLE `email_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user_id` (`user_id`),
  ADD KEY `idx_created_at` (`created_at`);

--
-- Индексы таблицы `email_verifications`
--
ALTER TABLE `email_verifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_email` (`email`),
  ADD KEY `idx_expires` (`expires_at`);

--
-- Индексы таблицы `folders`
--
ALTER TABLE `folders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `habits`
--
ALTER TABLE `habits`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `habit_monthly_configs`
--
ALTER TABLE `habit_monthly_configs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_config` (`habit_id`,`year`,`month`);

--
-- Индексы таблицы `habit_records`
--
ALTER TABLE `habit_records`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_record` (`user_id`,`habit_id`,`year`,`month`,`day`),
  ADD KEY `habit_id` (`habit_id`);

--
-- Индексы таблицы `message_reactions`
--
ALTER TABLE `message_reactions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_reaction` (`message_id`,`user_id`);

--
-- Индексы таблицы `password_resets`
--
ALTER TABLE `password_resets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_email` (`email`),
  ADD KEY `idx_code` (`code`);

--
-- Индексы таблицы `secret_chat`
--
ALTER TABLE `secret_chat`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `secret_chat_messages`
--
ALTER TABLE `secret_chat_messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `secret_chat_settings`
--
ALTER TABLE `secret_chat_settings`
  ADD PRIMARY KEY (`key`);

--
-- Индексы таблицы `secret_chat_user_meta`
--
ALTER TABLE `secret_chat_user_meta`
  ADD PRIMARY KEY (`user_id`);

--
-- Индексы таблицы `subtasks`
--
ALTER TABLE `subtasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `task_id` (`task_id`);

--
-- Индексы таблицы `tasks`
--
ALTER TABLE `tasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_folder` (`folder_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `app_announcements`
--
ALTER TABLE `app_announcements`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `birthdays`
--
ALTER TABLE `birthdays`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT для таблицы `email_logs`
--
ALTER TABLE `email_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `email_verifications`
--
ALTER TABLE `email_verifications`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- AUTO_INCREMENT для таблицы `folders`
--
ALTER TABLE `folders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `habits`
--
ALTER TABLE `habits`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=110;

--
-- AUTO_INCREMENT для таблицы `habit_monthly_configs`
--
ALTER TABLE `habit_monthly_configs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=109;

--
-- AUTO_INCREMENT для таблицы `habit_records`
--
ALTER TABLE `habit_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1496;

--
-- AUTO_INCREMENT для таблицы `message_reactions`
--
ALTER TABLE `message_reactions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;

--
-- AUTO_INCREMENT для таблицы `password_resets`
--
ALTER TABLE `password_resets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT для таблицы `secret_chat`
--
ALTER TABLE `secret_chat`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT для таблицы `secret_chat_messages`
--
ALTER TABLE `secret_chat_messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `subtasks`
--
ALTER TABLE `subtasks`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;

--
-- AUTO_INCREMENT для таблицы `tasks`
--
ALTER TABLE `tasks`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1769773614019;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1008;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `habits`
--
ALTER TABLE `habits`
  ADD CONSTRAINT `habits_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `habit_monthly_configs`
--
ALTER TABLE `habit_monthly_configs`
  ADD CONSTRAINT `habit_monthly_configs_ibfk_1` FOREIGN KEY (`habit_id`) REFERENCES `habits` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `habit_records`
--
ALTER TABLE `habit_records`
  ADD CONSTRAINT `habit_records_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `habit_records_ibfk_2` FOREIGN KEY (`habit_id`) REFERENCES `habits` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `secret_chat`
--
ALTER TABLE `secret_chat`
  ADD CONSTRAINT `secret_chat_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `secret_chat_messages`
--
ALTER TABLE `secret_chat_messages`
  ADD CONSTRAINT `secret_chat_messages_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `secret_chat_user_meta`
--
ALTER TABLE `secret_chat_user_meta`
  ADD CONSTRAINT `secret_chat_user_meta_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `subtasks`
--
ALTER TABLE `subtasks`
  ADD CONSTRAINT `subtasks_ibfk_1` FOREIGN KEY (`task_id`) REFERENCES `tasks` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `tasks`
--
ALTER TABLE `tasks`
  ADD CONSTRAINT `fk_folder` FOREIGN KEY (`folder_id`) REFERENCES `folders` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
